List<String> allergyName = [
  "갑각류",
  "견과류",
  "달걀",
  "땅콩",
  "밀",
  "생선",
  "우유",
  "조개",
  "콩",
];

Map<String, String> allergyInfo = {
  "갑각류":
      "갑각류 알레르기는 주로 두드러기, 코막힘, 입가려움 등 경미한 증상을 일으키지만 심할 경우에는 아주 적은 양에도 생명을 위협하는 증상을 동반할 수 있습니다. ",
  "견과류":
      "견과류 알레르기는 유아기 이후에 주로 나타나며, 성장해 감에 따라 호전이 비교적 잘되는 우유나 계란과는 달리 보다 오래 지속되는 환자가 많고, 서구에 비하여 국내에서는 발생 빈도가 낮지만 최근 증가하는 원인식품입니다. 증상은 경미한 것에서부터 아나필락시스까지 다양하게 나타나며, 여러 종류의 견과류에 동시에 반응을 보이는 환자도 있습니다.",
  "달걀":
      "달걀은 알레르기를 일으키는 식품 중 가장 흔한 것의 하나로, 특히 영유아에게서 흔하게 나타납니다. 징후 및 증상은 경미한 것에서부터 심각한 것까지 있는데 피부발진, 두드러기같은 피부 증상, 기침, 호흡곤란 등 호흡기 증상, 구토, 복통 등의 위장관 증상이 포함됩니다. 어린나이 아나필락시스의 주요원인입니다. 다행히 대부분의 아동들은 5~7세경에 알레르기에서 벗어나는 경우가 많습니다.",
  "땅콩":
      "땅콩에 대한 알레르기 반응의 대부분은 미약하며 땅콩이 피부를 스친 입 주위의 두드러기 혹은 다른 신체 부위의 좀더 전신적 두드러기로 구성됩니다. 다른 흔한 징후로는 땅콩 제품을 먹은 직후에 발생하는 복통 및 구토입니다. 좀더 민감한 어린이는 기도에서 발생하는 알레르기 반응으로 인한 기침, 천명, 숨가쁨 혹은 쉰 목소리가 생길 수 있습니다. ",
  "밀":
      "밀 알레르기는 아동, 청소년, 성인에게서 비교적 흔하게 발생합니다. 두드러기, 호흡곤란, 위장관 증상, 아나필락시스 등을 일으키며, 운동과 연관된 특수 형태의 아나필락시스의 흔한 원인입니다.",
  "생선":
      "생선 등 해산물 알레르기는 보통 경미한 증상을 보이지만 심할 경우 생명을 위협할 수도 있습니다. 성인이 되어 처음 증상이 나타나는 경우도 흔하며 잘 없어지지 않고 평생 지속되는 경우가 많습니다. ",
  "우유":
      "우유 알레르기는 영유아 및 아동에서 흔히 발생하는 식품 알레르기입니다. 징후 및 증상은 경미한 것에서부터 심각한 것까지 있는데 피부발진, 두드러기같은 피부 증상과 기침과 호흡곤란 등 호흡기 증상, 구토, 복통 등의 위장관 증상이 포함됩니다. 어린나이 아나필락시스의 주요원인입니다. 다행히 대부분의 아동들은 5~7세경에 우유 알 레르기에서 벗어나는 경우가 많습니다. 우유 알레르기 환자는 유제품, 산양유도 주의해야합니다.",
  "조개":
      "조개갑각류 알레르기는 어린이에게도 발생하지만 청소년과 성인에서 더 많이 발생합니다. 조개갑각류 알레르기 환자의 60%는 성인기에 처음 반응이 나타납니다. 조개갑각류 알레르기는 성인에서 흔히 볼 수 있으므로 일반적으로 사라지지 않는 평생 알레르기로 간주됩니다.",
  "콩":
      "콩은 아동에서 알레르기를 일으키는 식품 중 하나로, 아나필락시스와 같은 심각한 반응은 흔하지 않지만, 기타 식품알레르기의 경우와 마찬가지로 다양한 증상을 유발할 수 있습니다.",
};
